Repository: Abhishekdhal/krishinoor_frontend
Catalog: krishinoor/lib/l10n/app_*.arb
Languages: hi, ml, or

# appTitle
source: KRISHINOOR
hi: कृषिनूर
ml: കൃഷിനൂർ
or: କୃଷ୍ଣନୂର୍

source: Welcome
hi: स्वागत है
ml: സ്വാഗതം
or: ସ୍ୱାଗତ

# authMessage
source: Securely login to your account
hi: अपने खाते में सुरक्षित रूप से लॉगिन करें
ml: സുരക്ഷിതമായി അക്കൗണ്ടിൽ പ്രവേശിക്കുക
or: ଆପଣଙ୍କ ଆକାଉଣ୍ଟରେ ସୁରକ୍ଷିତ ଭାବରେ ଲଗଇନ୍ କରନ୍ତୁ

source: Login
hi: लॉगिन करें
ml: ലോഗിൻ
or: ଲଗଇନ୍ କରନ୍ତୁ

source: Sign Up
hi: साइन अप करें
ml: പുതിയ അക്കൗണ്ട്
or: ସାଇନ୍ ଅପ୍ କରନ୍ତୁ

# loginWithGoogle
source: Continue with Google
hi: गूगल के साथ जारी रखें
ml: ഗൂഗിള്‍ വഴി പ്രവേശിക്കുക
or: ଗୁଗୁଲ୍ ସହିତ ଜାରି ରଖନ୍ତୁ

source: Password
hi: पासवर्ड
ml: പാസ്‌വേഡ്
or: ପାସୱାର୍ଡ

# dontHaveAccount
source: Don't have an account?
hi: खाता नहीं है?
ml: അക്കൗണ്ട് ഇല്ലേ?
or: ଆକାଉଣ୍ଟ୍ ନାହିଁ?

# alreadyHaveAccount
source: Already have an account?
hi: पहले से खाता है?
ml: ഇതിനകം അക്കൗണ്ട് ഉണ്ടോ?
or: ପୂର୍ବରୁ ଆକାଉଣ୍ଟ୍ ଅଛି?

source: OR
hi: या
ml: അല്ലെങ്കിൽ
or: ବା

# continueButton
source: Continue
hi: जारी रखें
ml: തുടരുക
or: ଜାରି ରଖନ୍ତୁ

source: Email
hi: ईमेल
ml: ഇമെയിൽ
or: ଇମେଲ୍

source: Name
hi: नाम
ml: പേര്
or: ନାମ

# phone
source: Phone Number
hi: फ़ोन नंबर
ml: ഫോൺ നമ്പർ
or: ଫୋନ୍ ନମ୍ବର

# language
source: Preferred Language
hi: पसंदीदा भाषा
ml: ഭാഷ
or: ପସନ୍ଦିତ ଭାଷା

# fillAllFields
source: Please fill all fields
hi: कृपया सभी फ़ील्ड भरें
ml: ദയവായി എല്ലാം പൂരിപ്പിക്കുക
or: ଦୟାକରି ସମସ୍ତ ଫିଲ୍ଡ ଭରନ୍ତୁ

source: Invalid credentials
hi: अमान्य क्रेडेंशियल्स
ml: അസാധുവായ വിവരങ്ങൾ
or: ଅବୈଧ ପ୍ରମାଣପତ୍ର

source: Login failed
hi: लॉगिन विफल
ml: ലോഗിൻ പരാജയപ്പെട്ടു
or: ଲଗଇନ୍ ବିଫଳ ହେଲା

# signupSuccess
source: Sign up successful!
hi: साइन अप सफल!
ml: അക്കൗണ്ട് വിജയകരമായി സൃഷ്ടിച്ചു!
or: ସାଇନ୍ ଅପ୍ ସଫଳ ହେଲା!

source: Sign up failed
hi: साइन अप विफल
ml: അക്കൗണ്ട് സൃഷ്ടിക്കൽ പരാജയപ്പെട്ടു
or: ସାଇନ୍ ଅପ୍ ବିଫଳ ହେଲା

source: Logout
hi: लॉग आउट
ml: പുറത്ത് പോകുക
or: ଲଗଆଉଟ୍

# homeTitle
source: Farmers of India
hi: भारत के किसान
ml: ഇന്ത്യയിലെ കർഷകർ
or: ଭାରତର କୃଷକ

source: Supplements
hi: पूरक
ml: പൂരകങ്ങൾ
or: ପରିପୂରକ

source: Weather
hi: मौसम
ml: കാലാവസ്ഥ
or: ପାଣିପାଗ

source: AI Bot
hi: एआई बोट
ml: എ.ഐ സഹായി
or: AI ବଟ୍

source: Notice Board
hi: सूचना पटल
ml: അറിയിപ്പുകൾ
or: ନୋଟିସ୍ ବୋର୍ଡ

source: IoT Farming
hi: आईओटी खेती
ml: ഐ.ഒ.ടി കൃഷി
or: IoT ଚାଷ

source: Soil Health
hi: मिट्टी का स्वास्थ्य
ml: മണ്ണിന്റെ ആരോഗ്യം
or: ମାଟିର ସ୍ୱାସ୍ଥ୍ୟ

source: Market Prices
hi: बाज़ार मूल्य
ml: ചന്ത വിലകൾ
or: ବଜାର ଦର

source: Crop Problem Detector
hi: फसल समस्या डिटेक्टर
ml: വിള പ്രശ്നം കണ്ടെത്തി
or: ଫସଲ ସମସ୍ୟା ଡିଟେକ୍ଟର୍

source: Feedback
hi: फीडबैक
ml: അഭിപ്രായം
or: ଫିଡବ୍ୟାକ୍

source: Ask AI Bot
hi: एआई बोट से पूछें
ml: എ.ഐ സഹായിയോട് ചോദിക്കുക
or: AI ବଟକୁ ପଚାରନ୍ତୁ

# soilHealthTitle
source: Soil Fertility Analyzer
hi: मिट्टी उर्वरता विश्लेषक
ml: മണ്ണിന്റെ ഉർവരശേഷി പരിശോധന
or: ମାଟି ଉର୍ବରତା ବିଶ୍ଳେଷକ

# enterValues
source: 🌱 Enter Soil Test Values
hi: 🌱 मिट्टी परीक्षण मान दर्ज करें
ml: 🌱 മണ്ണ് പരിശോധനയുടെ മൂല്യങ്ങൾ നൽകുക
or: 🌱 ମାଟି ପରୀକ୍ଷା ମୂଲ୍ୟ ଦାଖଲ କରନ୍ତୁ

# phLabel
source: Soil pH (e.g., 6.5)
hi: मिट्टी का पीएच (जैसे, 6.5)
ml: മണ്ണിന്റെ പി.എച്ച് (ഉദാ: 6.5)
or: ମାଟିର pH (ଉଦାହରଣ: 6.5)

# nLabel
source: Nitrogen (0-100)
hi: नाइट्रोजन (0-100)
ml: നൈട്രജൻ (0-100)
or: ଯବକ୍ଷାରଜାନ (0-100)

# pLabel
source: Phosphorus (0-100)
hi: फास्फोरस (0-100)
ml: ഫോസ്ഫറസ് (0-100)
or: ଫସଫରସ୍ (0-100)

# kLabel
source: Potassium (0-100)
hi: पोटेशियम (0-100)
ml: പൊട്ടാസ്യം (0-100)
or: ପୋଟାସିୟମ୍ (0-100)

# analyzeButton
source: Analyze Soil
hi: मिट्टी का विश्लेषण करें
ml: മണ്ണ് വിശകലനം
or: ମାଟି ବିଶ୍ଳେଷଣ କରନ୍ତୁ

source: ✅ Best Practices
hi: ✅ सर्वोत्तम अभ्यास
ml: ✅ നല്ല രീതികൾ
or: ✅ ସର୍ବୋତ୍ତମ ଅଭ୍ୟାସ

# practice1
source: Use organic manure to improve soil structure.
hi: मिट्टी की संरचना सुधारने के लिए जैविक खाद का प्रयोग करें।
ml: മണ്ണിന്റെ ഗുണം മെച്ചപ്പെടുത്താൻ ജൈവ വളം ഉപയോഗിക്കുക.
or: ମାଟିର ଗଠନ ସୁଧାରିବା ପାଇଁ ଜୈବିକ ସାର ବ୍ୟବହାର କରନ୍ତୁ।

# practice2
source: Rotate crops to maintain fertility.
hi: उर्वरता बनाए रखने के लिए फसलों को बदल-बदल कर बोएं।
ml: മണ്ണിന്റെ ഉർവരത നിലനിർത്താൻ വിളകൾ മാറി മാറി കൃഷി ചെയ്യുക.
or: ଉର୍ବରତା ବଜାୟ ରଖିବା ପାଇଁ ଫସଲକୁ ବଦଳାଇ ଚାଷ କରନ୍ତୁ।

# practice3
source: Avoid excessive use of chemical fertilizers.
hi: रासायनिक उर्वरकों का अत्यधिक उपयोग करने से बचें।
ml: കൂടുതൽ രാസവളം ഒഴിവാക്കുക.
or: ରାସାୟନିକ ସାରର ଅତ୍ୟଧିକ ବ୍ୟବହାରରୁ ଦୂରେଇ ରୁହନ୍ତୁ।

# practice4
source: Test soil every 2-3 years for better planning.
hi: बेहतर योजना के लिए हर 2-3 साल में मिट्टी का परीक्षण करें।
ml: 2-3 വർഷത്തിലൊരിക്കൽ മണ്ണ് പരിശോധന നടത്തുക.
or: ଉନ୍ନତ ଯୋଜନା ପାଇଁ ପ୍ରତି 2-3 ବର୍ଷରେ ମାଟି ପରୀକ୍ଷା କରନ୍ତୁ।

# invalidValues
source: Please enter valid numeric values.
hi: कृपया वैध संख्यात्मक मान दर्ज करें।
ml: ദയവായി ശരിയായ സംഖ്യ നൽകുക.
or: ଦୟାକରି ବୈଧ ସଂଖ୍ୟା ମୂଲ୍ୟ ଦାଖଲ କରନ୍ତୁ।

# acidicSoil
source: Soil is acidic. Add lime. Crops: Potato, Pineapple, Rice.
hi: मिट्टी अम्लीय है। चूना डालें। फसलें: आलू, अनानास, चावल।
ml: മണ്ണ് അമ്ലീയമാണ്. ചുണ്ണാമ്പ് ചേർക്കുക. വിളകൾ: ഉരുളക്കിഴങ്ങ്, കപ്പ, നെല്ല്.
or: ମାଟି ଅମ୍ଳୀୟ ଅଟେ। ଚୂନ ମିଶାନ୍ତୁ। ଫସଲ: ଆଳୁ, ଅନାନସ, ଧାନ।

# alkalineSoil
source: Soil is alkaline. Add gypsum/organic matter. Crops: Cotton, Sugar beet, Barley.
hi: मिट्टी क्षारीय है। जिप्सम/जैविक पदार्थ डालें। फसलें: कपास, चुकंदर, जौ।
ml: മണ്ണ് ക്ഷാരമാണ്. ജിപ്സം അല്ലെങ്കിൽ ജൈവവസ്തു ചേർക്കുക. വിളകൾ: പരുത്തി, ബീറ്റ്റൂട്ട്, യവം.
or: ମାଟି କ୍ଷାରୀୟ ଅଟେ। ଜିପସମ୍/ଜୈବିକ ପଦାର୍ଥ ମିଶାନ୍ତୁ। ଫସଲ: କପା, ଚିନି ବିଟ୍, ଯଅ।

# goodSoil
source: Soil pH is good for most crops.
hi: मिट्टी का पीएच अधिकांश फसलों के लिए अच्छा है।
ml: മണ്ണിന്റെ പി.എച്ച് വിളകൾക്ക് അനുയോജ്യമാണ്.
or: ଅଧିକାଂଶ ଫସଲ ପାଇଁ ମାଟିର pH ଭଲ ଅଛି।

# addN
source: Add Urea (Nitrogen).
hi: यूरिया (नाइट्रोजन) डालें।
ml: യൂറിയ (നൈട്രജൻ) ചേർക്കുക.
or: ୟୁରିଆ (ଯବକ୍ଷାରଜାନ) ମିଶାନ୍ତୁ।

# addP
source: Add DAP (Phosphorus).
hi: डीएपी (फास्फोरस) डालें।
ml: ഡി.എ.പി (ഫോസ്ഫറസ്) ചേർക്കുക.
or: ଡିଏପି (ଫସଫରସ୍) ମିଶାନ୍ତୁ।

# addK
source: Add MOP (Potassium).
hi: एमओपी (पोटेशियम) डालें।
ml: എം.ഒ.പി (പൊട്ടാസ്യം) ചേർക്കുക.
or: ଏମ୍ଓପି (ପୋଟାସିୟମ୍) ମିଶାନ୍ତୁ।

# balancedNPK
source: NPK levels are balanced. Maintain with compost.
hi: एनपीके का स्तर संतुलित है। खाद से बनाए रखें।
ml: എൻ.പി.കെ നില ശരിയാണ്. വളം നിയന്ത്രിതമായി ഉപയോഗിക്കുക.
or: NPK ସ୍ତର ସନ୍ତୁଳିତ ଅଛି। କମ୍ପୋଷ୍ଟ ସହିତ ବଜାୟ ରଖନ୍ତୁ।

# marketTitle
source: 🌾 Market Prices
hi: 🌾 बाज़ार मूल्य
ml: 🌾 ചന്ത വിലകൾ
or: 🌾 ବଜାର ଦର

# tabFertilizers
source: Fertilizers
hi: उर्वरक
ml: വളങ്ങൾ
or: ସାର

# tabSeeds
source: Seeds
hi: बीज
ml: വിത്തുകൾ
or: ବୀଜ

# tabSprays
source: Sprays
hi: स्प्रे
ml: സ്പ്രേകൾ
or: ସ୍ପ୍ରେ

# tabNutrients
source: Nutrients
hi: पोषक तत्व
ml: പോഷകങ്ങൾ
or: ପୋଷକ ତତ୍ତ୍ୱ

# bestLabel
source: Best
hi: सर्वोत्तम
ml: മികച്ചത്
or: ସର୍ବୋତ୍ତମ

source: Amazon
hi: अमेज़न
ml: അമസോൺ
or: ଆମାଜନ୍

source: Flipkart
hi: फ्लिपकार्ट
ml: ഫ്ലിപ്കാർട്ട്
or: ଫ୍ଲିପକାର୍ଟ

source: Mandi
hi: मंडी
ml: മണ്ടി
or: ମଣ୍ଡି

# day
source: Day {value}
hi: दिन {value}
ml: ദിവസം {value}
or: ଦିନ {value}

# iotTitle
source: IoT-based Farming
hi: आईओटी-आधारित खेती
ml: ഐ.ഒ.ടി അടിസ്ഥാന കൃഷി
or: IoT-ଆଧାରିତ ଚାଷ

# iotDescription
source: Soil suitability analysis using IoT devices.
hi: आईओटी उपकरणों का उपयोग करके मिट्टी की उपयुक्तता का विश्लेषण।
ml: ഐ.ഒ.ടി ഉപകരണങ്ങൾ ഉപയോഗിച്ച് മണ്ണിന്റെ സ്ഥിതി പരിശോധിക്കുക.
or: IoT ଉପକରଣ ବ୍ୟବହାର କରି ମାଟିର ଉପଯୁକ୍ତତା ବିଶ୍ଳେଷଣ।

# feedbackTitle
source: 💬 Feedback
hi: 💬 फीडबैक
ml: 💬 അഭിപ്രായം
or: 💬 ଫିଡବ୍ୟାକ୍

# feedbackHeader
source: We value your feedback 💚
hi: हम आपके फीडबैक को महत्व देते हैं 💚
ml: നിങ്ങളുടെ അഭിപ്രായം ഞങ്ങൾക്ക് വളരെ പ്രധാനമാണ് 💚
or: ଆମେ ଆପଣଙ୍କ ଫିଡବ୍ୟାକ୍କୁ ଗୁରୁତ୍ୱ ଦେଉଛୁ 💚

source: Your Name
hi: आपका नाम
ml: നിങ്ങളുടെ പേര്
or: ଆପଣଙ୍କ ନାମ

source: Your Feedback
hi: आपका फीडबैक
ml: നിങ്ങളുടെ അഭിപ്രായം
or: ଆପଣଙ୍କ ଫିଡବ୍ୟାକ୍

# noImage
source: 📷 No image selected
hi: 📷 कोई छवि नहीं चुनी गई
ml: 📷 ചിത്രം തിരഞ്ഞെടുത്തിട്ടില്ല
or: 📷 କୌଣସି ପ୍ରତିଛବି ଚୟନ କରାଯାଇ ନାହିଁ

source: Upload Photo
hi: फोटो अपलोड करें
ml: ഫോട്ടോ അപ്‌ലോഡ് ചെയ്യുക
or: ଫଟୋ ଅପଲୋଡ୍ କରନ୍ତୁ

source: Submit Feedback
hi: फीडबैक सबमिट करें
ml: അഭിപ്രായം സമർപ്പിക്കുക
or: ଫିଡବ୍ୟାକ୍ ଦାଖଲ କରନ୍ତୁ

source: 🎉 Thank You!
hi: 🎉 धन्यवाद!
ml: 🎉 നന്ദി!
or: 🎉 ଧନ୍ୟବାଦ!

# thankYouMessage
source: Your feedback has been submitted successfully. We appreciate your time 💚
hi: आपका फीडबैक सफलतापूर्वक सबमिट कर दिया गया है। हम आपके समय की सराहना करते हैं 💚
ml: നിങ്ങളുടെ അഭിപ്രായം വിജയകരമായി സമർപ്പിച്ചു. നിങ്ങളുടെ സമയം വിലമതിക്കുന്നു 💚
or: ଆପଣଙ୍କ ଫିଡବ୍ୟାକ୍ ସଫଳତାର ସହିତ ଦାଖଲ କରାଯାଇଛି। ଆମେ ଆପଣଙ୍କ ସମୟକୁ ପ୍ରଶଂସା କରୁଛୁ 💚

source: OK
hi: ठीक है
ml: ശരി
or: ଠିକ୍ ଅଛି

# pleaseEnter
source: ⚠️ Please enter name and feedback
hi: ⚠️ कृपया नाम और फीडबैक दर्ज करें
ml: ⚠️ ദയവായി പേര്, അഭിപ്രായം നൽകുക
or: ⚠️ ଦୟାକରି ନାମ ଏବଂ ଫିଡବ୍ୟାକ୍ ଦାଖଲ କରନ୍ତୁ

# problemDetectorTitle
source: Problem Detector
hi: समस्या डिटेक्टर
ml: പ്രശ്നം കണ്ടെത്തൽ
or: ସମସ୍ୟା ଡିଟେକ୍ଟର୍

source: Problem Description
hi: समस्या का विवरण
ml: പ്രശ്നത്തിന്റെ വിശദീകരണം
or: ସମସ୍ୟା ବିବରଣୀ

source: No image selected
hi: कोई छवि नहीं चुनी गई
ml: ചിത്രം തിരഞ്ഞെടുത്തിട്ടില്ല
or: କୌଣସି ପ୍ରତିଛବି ଚୟନ କରାଯାଇ ନାହିଁ

source: Take/Choose Image
hi: छवि लें/चुनें
ml: ചിത്രം എടുക്കുക/തിരഞ്ഞെടുക്കുക
or: ପ୍ରତିଛବି ନିଅନ୍ତୁ/ବାଛନ୍ତୁ

source: UPLOAD
hi: अपलोड करें
ml: അപ്‌ലോഡ്
or: ଅପଲୋଡ୍

# addDescriptionAndImage
source: Please add description and image ❌
hi: कृपया विवरण और छवि जोड़ें ❌
ml: ദയവായി വിവരണവും ചിത്രവും ചേർക്കുക ❌
or: ଦୟାକରି ବିବରଣୀ ଏବଂ ପ୍ରତିଛବି ଯୋଡନ୍ତୁ ❌

# problemReportedSuccess
source: Problem reported successfully ✅
hi: समस्या सफलतापूर्वक रिपोर्ट की गई ✅
ml: പ്രശ്നം വിജയകരമായി റിപ്പോർട്ട് ചെയ്തു ✅
or: ସମସ୍ୟା ସଫଳତାର ସହିତ ରିପୋର୍ଟ ହେଲା ✅

source: Error ❌
hi: त्रुटि ❌
ml: പിശക് ❌
or: ତ୍ରୁଟି ❌

# weatherTitle
source: Weather
hi: मौसम
ml: കാലാവസ്ഥ
or: ପାଣିପାଗ

# farmingTip_rain
source: 🌧 Good for paddy and rice crops. Avoid pesticide spraying today.
hi: 🌧 धान और चावल की फसलों के लिए अच्छा है। आज कीटनाशक छिड़काव से बचें।
ml: 🌧 നെല്ലിനും അരിക്കും അനുയോജ്യം. ഇന്ന് സ്പ്രേ ഒഴിവാക്കുക.
or: 🌧 ଧାନ ଏବଂ ଚାଉଳ ଫସଲ ପାଇଁ ଭଲ। ଆଜି କୀଟନାଶକ ସ୍ପ୍ରେ କରିବାରୁ ଦୂରେଇ ରୁହନ୍ତୁ।

# farmingTip_hot
source: ☀️ Too hot! Irrigation is required to protect young plants.
hi: ☀️ बहुत गर्म! युवा पौधों को बचाने के लिए सिंचाई की आवश्यकता है।
ml: ☀️ കനത്ത ചൂട്! ചെറു സസ്യങ്ങൾക്ക് ജലസേചനം നിർബന്ധം.
or: ☀️ ବହୁତ ଗରମ! ଛୋଟ ଗଛକୁ ସୁରକ୍ଷା ଦେବା ପାଇଁ ଜଳସେଚନ ଆବଶ୍ୟକ।

# farmingTip_sunny
source: ☀️ Sunny day, good for harvesting and drying crops.
hi: ☀️ धूप वाला दिन, कटाई और फसल सुखाने के लिए अच्छा है।
ml: ☀️ തെളിഞ്ഞ ദിവസം – കൊയ്ത്തിനും വിള ഉണക്കലിനും നല്ലത്.
or: ☀️ ଖରା ଦିନ, ଅମଳ ଏବଂ ଫସଲ ଶୁଖାଇବା ପାଇଁ ଭଲ।

# farmingTip_cloudy
source: 🌥 Cloudy skies – good day for sowing seeds, soil moisture will remain.
hi: 🌥 बादल छाए हुए हैं – बीज बोने के लिए अच्छा दिन, मिट्टी की नमी बनी रहेगी।
ml: 🌥 മേഘാവൃതം – വിത്ത് വിതയ്ക്കാൻ നല്ല സമയം, മണ്ണിൽ ഈർപ്പം നിലനിൽക്കും.
or: 🌥 ମେଘୁଆ ଆକାଶ – ମଞ୍ଜି ବୁଣିବା ପାଇଁ ଭଲ ଦିନ, ମାଟିର ଆର୍ଦ୍ରତା ରହିବ।

# farmingTip_humidity
source: 💧 High humidity – watch out for fungal diseases in crops.
hi: 💧 उच्च आर्द्रता – फसलों में फफूंद जनित रोगों से सावधान रहें।
ml: 💧 കൂടുതലായ ഈർപ്പം – വിളകളിൽ ഫംഗസ് രോഗത്തിൽ ജാഗ്രത പാലിക്കുക.
or: 💧 ଅଧିକ ଆର୍ଦ୍ରତା – ଫସଲରେ କବକ ରୋଗ ପାଇଁ ସତର୍କ ରୁହନ୍ତୁ।

# farmingTip_normal
source: 🌱 Normal conditions – good for regular farming activities.
hi: 🌱 सामान्य स्थितियाँ – नियमित खेती की गतिविधियों के लिए अच्छा है।
ml: 🌱 സാധാരണ സാഹചര്യം – പതിവ് കൃഷിക്ക് നല്ലത്.
or: 🌱 ସାଧାରଣ ପରିସ୍ଥିତି – ନିୟମିତ ଚାଷ କାର୍ଯ୍ୟ ପାଇଁ ଭଲ।

source: Farmer
hi: किसान
ml: കർഷകൻ
or: କୃଷକ

# notAvailable
source: N/A
hi: उपलब्ध नहीं है
ml: ലഭ്യമല്ല
or: ଉପଲବ୍ଧ ନୁହେଁ

# logoutFailed
source: Failed to log out, please try again.
hi: लॉग आउट विफल रहा, कृपया पुनः प्रयास करें।
ml: പുറത്ത് പോകൽ പരാജയപ്പെട്ടു, വീണ്ടും ശ്രമിക്കുക.
or: ଲଗଆଉଟ୍ ବିଫଳ ହେଲା, ଦୟାକରି ପୁଣି ଚେଷ୍ଟା କରନ୍ତୁ।

# hello
source: Hello, {userName}
hi: नमस्ते, {userName}
ml: നമസ്കാരം,
or: ନମସ୍କାର,

# profileUpdated
source: Profile updated successfully!
hi: प्रोफाइल सफलतापूर्वक अपडेट की गई!
ml: പ്രൊഫൈൽ അപ്‌ഡേറ്റ് ചെയ്തു!
or: ପ୍ରୋଫାଇଲ୍ ସଫଳତାର ସହିତ ଅପଡେଟ୍ ହେଲା!

source: Profile
hi: प्रोफ़ाइल
ml: പ്രൊഫൈൽ
or: ପ୍ରୋଫାଇଲ୍

source: Save
hi: सहेजें
ml: സംരക്ഷിക്കുക
or: ସେଭ୍ କରନ୍ତୁ

# botNameTitle
source: KRISHI MITRA
hi: कृषि मित्र
ml: കൃഷി മിത്ര
or: କୃଷି ମିତ୍ର

# botSubtitle
source: Your AI Farming Assistant
hi: आपका एआई कृषि सहायक
ml: നിങ്ങളുടെ എ.ഐ കൃഷി സഹായി
or: ଆପଣଙ୍କ AI ଚାଷ ସହାୟକ

# krishiMitraWelcome
source: Hello! I'm Krishi Mitra 🌱 You can ask me about crops, soil, pests, and farming. You can also send photos for analysis!
hi: नमस्ते! मैं कृषि मित्र हूँ 🌱 आप मुझसे फसल, मिट्टी, कीट-पतंगों और खेती के बारे में सवाल पूछ सकते हैं। आप विश्लेषण के लिए तस्वीरें भी भेज सकते हैं!
ml: നമസ്കാരം! ഞാൻ കൃഷി മിത്രയാണ് 🌱 വിളകൾ, മണ്ണ്, കീടങ്ങൾ, കൃഷി എന്നിവയെക്കുറിച്ച് നിങ്ങൾ ചോദിക്കാം. വിശകലനത്തിന് ചിത്രം അയയ്ക്കാം!
or: ନମସ୍କାର! ମୁଁ କୃଷି ମିତ୍ର 🌱 ଆପଣ ମୋତେ ଫସଲ, ମାଟି, କୀଟପତଙ୍ଗ ଏବଂ ଚାଷ ବିଷୟରେ ପ୍ରଶ୍ନ ପଚାରିପାରିବେ। ଆପଣ ବିଶ୍ଳେଷଣ ପାଇଁ ଫଟୋ ମଧ୍ୟ ପଠାଇପାରିବେ!

# clearChatTooltip
source: Clear Chat
hi: चैट साफ़ करें
ml: ചാറ്റ് മായ്ക്കുക
or: ଚାଟ୍ ସଫା କରନ୍ତୁ

# botThinking
source: Krishi Mitra is thinking...
hi: कृषि मित्र सोच रहा है...
ml: കൃഷി മിത്ര ആലോചിക്കുന്നു...
or: କୃଷି ମିତ୍ର ଭାବୁଛି...

# askBotHint
source: Ask Krishi Mitra...
hi: कृषि मित्र से पूछें...
ml: കൃഷി മിത്രയോട് ചോദിക്കുക...
or: କୃଷି ମିତ୍ରକୁ ପଚାରନ୍ତୁ...

# sentImagePlaceholder
source: 📷 Sent an image for analysis
hi: 📷 विश्लेषण के लिए एक तस्वीर भेजी
ml: 📷 വിശകലനത്തിന് ചിത്രം അയച്ചു
or: 📷 ବିଶ୍ଳେଷଣ ପାଇଁ ଏକ ଫଟୋ ପଠାଇଲେ

# analyzeImagePrompt
source: Analyze this crop/soil image and give practical farming advice.
hi: इस फसल/मिट्टी की तस्वीर का विश्लेषण करें और व्यावहारिक खेती की सलाह दें।
ml: ഈ വിള/മണ്ണിന്റെ ചിത്രം വിശകലനം ചെയ്ത് നല്ല ഉപദേശം നൽകുക.
or: ଏହି ଫସଲ/ମାଟି ଫଟୋର ବିଶ୍ଳେଷଣ କରନ୍ତୁ ଏବଂ ବ୍ୟାବହାରିକ ଚାଷ ପରାମର୍ଶ ଦିଅନ୍ତୁ।

# geminiApiKeyNotFound
source: ⚠️ Gemini API Key not found. Please configure your .env file.
hi: ⚠️ जेमिनी एपीआई कुंजी नहीं मिली। कृपया अपनी .env फ़ाइल कॉन्फ़िगर करें।
ml: ⚠️ ജെമിനി API കീ കണ്ടെത്തിയില്ല. ദയവായി .env ഫയൽ പരിശോധിക്കുക.
or: ⚠️ ଜେମିନି API କି ମିଳିଲା ନାହିଁ। ଦୟାକରି ଆପଣଙ୍କର .env ଫାଇଲ୍ କନଫିଗର୍ କରନ୍ତୁ।

source: ⚠️ No response from Gemini.
hi: ⚠️ जेमिनी से कोई प्रतिक्रिया नहीं।
ml: ⚠️ ജെമിനിയിൽ നിന്ന് പ്രതികരണം ലഭിച്ചില്ല.
or: ⚠️ ଜେମିନିରୁ କୌଣସି ପ୍ରତିକ୍ରିୟା ନାହିଁ।

source: ❌ Gemini API error:
hi: ❌ जेमिनी एपीआई त्रुटि:
ml: ❌ ജെമിനി API പിശക്:
or: ❌ ଜେମିନି API ତ୍ରୁଟି:

# welcomeBack
source: Welcome back! Let's grow together.
hi: फिर से स्वागत है! आइए साथ मिलकर खेती को आगे बढ़ाएँ।
ml: വീണ്ടും സ്വാഗതം! ഒരുമിച്ച് കൃഷിയെ മുന്നോട്ട് കൊണ്ടുപോകാം.
or: ପୁଣି ସ୍ୱାଗତ! ଆସନ୍ତୁ, ସହେ ଉନ୍ନତି କରିବା।

source: Today's Weather
hi: आज का मौसम
ml: ഇന്നത്തെ കാലാവസ്ഥ
or: ଆଜିର ପାଣିପାଗ

source: Market Alert
hi: बाज़ार अलर्ट
ml: ചന്ത മുന്നറിയിപ്പ്
or: ବଜାର ସଚେତନତା

# farmToolsAndServices
source: Farm Tools & Services
hi: खेती उपकरण और सेवाएँ
ml: കൃഷി ഉപകരണങ്ങളും സേവനങ്ങളും
or: କୃଷି ଯନ୍ତ୍ର ଏବଂ ସେବା

source: KRISHI MITRA
hi: कृषि मित्र
ml: കൃഷി മിത്ര
or: କୃଷି ମିତ୍ର

source: Ask KRISHI MITRA
hi: कृषि मित्र से पूछें
ml: കൃഷി മിത്രയോട് ചോദിക്കുക
or: କୃଷି ମିତ୍ରକୁ ପଚାରନ୍ତୁ

source: Loading...
hi: लोड हो रहा है...
ml: ലോഡ് ചെയ്യുന്നു...
or: ଲୋଡ୍ ହେଉଛି...

source: Unable to load
hi: लोड करने में असमर्थ
ml: ലോഡ് ചെയ്യാനായില്ല
or: ଲୋଡ୍ କରିପାରିଲା ନାହିଁ

source: Weather data
hi: मौसम डेटा
ml: കാലാവസ്ഥാ വിവരങ്ങൾ
or: ପାଣିପାଗ ତଥ୍ୟ

source: Farm Tools & Services
hi: कृषि उपकरण और सेवाएं
ml: കൃഷി ഉപകരണങ്ങളും സേവനങ്ങളും
or: କୃଷି ସାଧନ ଏବଂ ସେବା

# noticeBoardTitle
source: Notice Board
hi: नोटिस बोर्ड
ml: നോട്ടീസ് ബോർഡ്
or: ନୋଟିସ ବୋର୍ଡ

# latestUpdates
source: Latest updates & announcements
hi: नवीनतम अपडेट और घोषणाएँ
ml: പുതിയ അപ്‌ഡേറ്റുകളും പ്രഖ്യാപനങ്ങളും
or: ସେଷ ଅଦ୍ୟତନ ଓ ଘୋଷଣା

# filterAll
source: All
hi: सभी
ml: എല്ലാം
or: ସମସ୍ତ

# categoryScheme
source: Scheme
hi: योजना
ml: പദ്ധതി
or: ଯୋଜନା

# categoryTechnology
source: Technology
hi: प्रौद्योगिकी
ml: സാങ്കേതികവിദ്യ
or: ପ୍ରଯୁକ୍ତି

# categoryJobs
source: Jobs
hi: नौकरी
ml: ജോലികൾ
or: ଚାକିରି

# categoryFinance
source: Finance
hi: वित्त
ml: ധനകാര്യം
or: ଆର୍ଥିକ

# labelNew
source: NEW
hi: नया
ml: പുതിയത്
or: ନୂତନ

source: Read More
hi: और पढ़ें
ml: കൂടുതൽ വായിക്കുക
or: ଅଧିକ ପଢନ୍ତୁ

source: Notice Details
hi: नोटिस विवरण
ml: നോട്ടീസ് വിശദാംശങ്ങൾ
or: ନୋଟିସ ବିବରଣୀ

# noticeDetailsDescription
source: This is a detailed description of the notice. More information about the government initiative, scheme updates, or announcements will be displayed here. Farmers can find all relevant details and guidelines in this section.
hi: यह नोटिस का विस्तृत विवरण है। सरकारी पहल, योजना अद्यतन, या घोषणाओं के बारे में अधिक जानकारी यहाँ दिखाई जाएगी। किसान इस अनुभाग में सभी संबंधित निर्देश और विवरण पा सकते हैं।
ml: ഇത് നോട്ടീസിന്റെ വിശദമായ വിവരണമാണ്. സർക്കാർ പദ്ധതികൾ, പുതുക്കലുകൾ അല്ലെങ്കിൽ പ്രഖ്യാപനങ്ങളെക്കുറിച്ചുള്ള കൂടുതൽ വിവരങ്ങൾ ഇവിടെ പ്രദർശിപ്പിക്കും. കർഷകർക്ക് ബന്ധപ്പെട്ട എല്ലാ നിർദ്ദേശങ്ങളും വിശദാംശങ്ങളും ഈ വിഭാഗത്തിൽ ലഭ്യമാകും.
or: ଏହା ନୋଟିସର ବିସ୍ତୃତ ବର୍ଣ୍ଣନା। ସରକାରୀ ପ୍ରୟାସ, ଯୋଜନା ଅଦ୍ୟତନ କିମ୍ବା ଘୋଷଣା ସମ୍ପର୍କରେ ଅଧିକ ସୂଚନା ଏଠାରେ ପ୍ରଦର୍ଶିତ ହେବ। କୃଷକମାନେ ଏହି ବିଭାଗରେ ସମସ୍ତ ସମ୍ବନ୍ଧିତ ନିର୍ଦ୍ଦେଶନାମା ଓ ବିବରଣୀ ପାଇପାରିବେ।

source: Learn More
hi: और जानें
ml: കൂടുതൽ അറിയുക
or: ଅଧିକ ଜାଣନ୍ତୁ

# notice1Text
source: Cabinet has approved the Prime Minister Dhan-Dhanya agricultural scheme.
hi: कैबिनेट ने प्रधानमंत्री धन-धान्य कृषि योजना को मंज़ूरी दी।
ml: കാബിനറ്റ് പ്രധാനമന്ത്രി ധൻ-ധാന്യ കൃഷി പദ്ധതി അംഗീകരിച്ചു.
or: ମନ୍ତ୍ରିମଣ୍ଡଳ ପ୍ରଧାନମନ୍ତ୍ରୀ ଧନ-ଧାନ୍ୟ କୃଷି ଯୋଜନାକୁ ଅନୁମୋଦନ କଲା।

# notice2Text
source: Expression of interest for village-level crop yield estimation using technology for selected crops 2025-26.
hi: 2025-26 के लिए चयनित फसलों हेतु ग्राम पंचायत स्तर पर प्रौद्योगिकी का उपयोग कर फसल उपज अनुमान के लिए रुचि की अभिव्यक्ति।
ml: 2025-26 വർഷത്തേക്ക് തിരഞ്ഞെടുത്ത വിളകൾക്കായി ഗ്രാമപഞ്ചായത്ത് തലത്തിൽ വിളവെടുപ്പ് കണക്കാക്കാൻ സാങ്കേതിക വിദ്യ ഉപയോഗിക്കുന്നതിന് താൽപ്പര്യം പ്രകടിപ്പിക്കൽ.
or: 2025-26 ପାଇଁ ଚୟନିତ ଫସଳ ପାଇଁ ଗ୍ରାମ ପଞ୍ଚାୟତ ସ୍ତରରେ ଉତ୍ପାଦନ ଆନୁମାନ ପାଇଁ ପ୍ରଯୁକ୍ତି ବ୍ୟବହାର କରି ଆଗ୍ରହ ପ୍ରକାଶ।

# notice3Text
source: Thirteen vacancies to be filled for positions in National Farmer Welfare Implementation Society (NFWPIS).
hi: राष्ट्रीय किसान कल्याण कार्यान्वयन सोसाइटी (NFWPIS) में नियुक्ति के लिए तेरह पदों को भरना।
ml: ദേശീയ കർഷക ക്ഷേമ പദ്ധതി നടപ്പാക്കൽ സൊസൈറ്റി (NFWPIS)യിൽ പതിമൂന്ന് ഒഴിവുകൾ നിറയ്ക്കൽ.
or: ଜାତୀୟ କୃଷକ କଳ୍ୟାଣ କାର୍ଯ୍ୟକ୍ରମ ସମିତି (NFWPIS) ରେ 13ଟି ପଦବୀ ପାଇଁ ନିଯୁକ୍ତି।

# notice4Text
source: Minimum Support Price (MSP) for Kharif crops for the KMS 2025-26.
hi: खरीफ विपणन मौसम (KMS) 2025-26 के लिए खरीफ फसलों के न्यूनतम समर्थन मूल्य।
ml: KMS 2025-26-ലെ ഖരീഫ് വിളകൾക്ക് കുറഞ്ഞ പിന്തുണാ വില.
or: KMS 2025-26 ପାଇଁ ଖରିଫ ଫସଳର ନ୍ୟୁନତମ ସମର୍ଥନ ମୂଲ୍ୟ।

# notice5Text
source: Cabinet approved revised interest rate for FY 2025-26 with existing 1.5% interest subsidy (ISS).
hi: कैबिनेट ने वित्त वर्ष 2025-26 के लिए मौजूदा 1.5% ब्याज अनुदान (ISS) के साथ संशोधित ब्याज दर को मंजूरी दी।
ml: നിലവിലെ 1.5% പലിശ സബ്സിഡി (ISS) തുടർന്നും 2025-26 സാമ്പത്തിക വർഷത്തേക്ക് പരിഷ്കരിച്ച പലിശ നിരക്ക് കാബിനറ്റ് അംഗീകരിച്ചു.
or: ବର୍ତ୍ତମାନର 1.5% ସୁଧ ଅନୁଦାନ (ISS) ସହିତ 2025-26 ଆର୍ଥିକ ବର୍ଷ ପାଇଁ ସଂଶୋଧିତ ସୁଧ ହାରକୁ ମନ୍ତ୍ରିମଣ୍ଡଳ ଅନୁମୋଦନ କଲା।
